Repository: surajmca1940/project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: hi, ta

source: Digital Psychological Intervention System
hi: डिजिटल मनोवैज्ञानिक हस्तक्षेप प्रणाली
ta: டிஜிட்டல் உளவியல் தலையீட்டு அமைப்பு

source: Mental Health Platform
hi: मानसिक स्वास्थ्य मंच
ta: மன நலம் தளம்

source: AI Support
hi: एआई सहायता
ta: AI ஆதரவு

source: Book Appointment
hi: अपॉइंटमेंट बुक करें
ta: சந்திப்பு முன்பதிவு செய்யுங்கள்

source: Resources
hi: संसाधन
ta: வளங்கள்

source: Peer Support
hi: साथी सहारा
ta: சக ஆதரவு

source: Hello
hi: नमस्ते
ta: வணக்கம்

source: Logout
hi: लॉग आउट
ta: வெளியேறு

source: Dashboard
hi: डैशबोर्ड
ta: பணியிடம்

source: Login
hi: लॉग इन
ta: உள்நுழை

source: Register
hi: रजिस्टर करें
ta: பதிவு செய்

source: Digital Psychological Intervention System. All rights reserved.
hi: डिजिटल मनोवैज्ञानिक हस्तक्षेप प्रणाली। सभी अधिकार सुरक्षित।
ta: டிஜிட்டல் உளவியல் தலையீட்டு அமைப்பு। அனைத்து உரிமைகளும் பாதுகாக்கப்படுகின்றன.

source: Supporting mental health in higher education institutions
hi: उच्च शिक्षा संस्थानों में मानसिक स्वास्थ्य का समर्थन
ta: உயர்கல்வி நிறுவனங்களில் மன நலத்தை ஆதரித்தல்

source: Home
hi: होम
ta: முகப்பு

source: A comprehensive platform supporting mental health and well-being in higher education institutions
hi: उच्च शिक्षा संस्थानों में मानसिक स्वास्थ्य और कल्याण का समर्थन करने वाला एक व्यापक मंच
ta: உயர்கல்வி நிறுவனங்களில் மன நலம் மற்றும் நல்வாழ்வை ஆதரிக்கும் ஒரு விரிவான தளம்

source: Get AI Support
hi: एआई सहायता प्राप्त करें
ta: AI ஆதரவை பெறுங்கள்

source: AI-Guided Support
hi: एआई-निर्देशित सहायता
ta: AI வழிகாட்டும் ஆதரவு

source: Get immediate help with our interactive AI chatbot that provides coping strategies and professional referrals.
hi: हमारे इंटरेक्टिव एआई चैटबॉट से तत्काल सहायता प्राप्त करें जो मुकाबला रणनीतियां और पेशेवर रेफरल प्रदान करता है।
ta: சமாளிக்கும் உத்திகள் மற்றும் தொழில்முறை பரிந்துரைகளை வழங்கும் எங்கள் ஊடாடும் AI சாட்பாட் மூலம் உடனடி உதவி பெறுங்கள்.

source: Start Chat
hi: चैट शुरू करें
ta: அரட்டை தொடங்கு

source: Confidential Booking
hi: गोपनीय बुकिंग
ta: இரகசிய முன்பதிவு

source: Schedule appointments with campus counselors or mental health professionals in complete confidentiality.
hi: कैंपस परामर्शदाताओं या मानसिक स्वास्थ्य पेशेवरों के साथ पूर्ण गोपनीयता में अपॉइंटमेंट शेड्यूल करें।
ta: வளாக ஆலோசகர்கள் அல்லது மன நல நிபுணர்களுடன் முழு ரகசியத்தில் சந்திப்புகளை திட்டமிடுங்கள்.

source: Book Now
hi: अभी बुक करें
ta: இப்போது முன்பதிவு செய்யுங்கள்

source: Resource Hub
hi: संसाधन केंद्र
ta: வள மையம்

source: Access videos, audio content, and wellness guides in multiple regional languages.
hi: कई क्षेत्रीय भाषाओं में वीडियो, ऑडियो सामग्री और कल्याण गाइड तक पहुंचें।
ta: பல பிராந்திய மொழிகளில் வீடியோக்கள், ஆடியோ உள்ளடக்கம் மற்றும் நல்வாழ்வு வழிகாட்டிகளை அணுகவும்.

source: Explore Resources
hi: संसाधन खोजें
ta: வளங்களை ஆராயுங்கள்

source: Connect with fellow students in a moderated, safe environment with trained volunteers.
hi: प्रशिक्षित स्वयंसेवकों के साथ एक नियंत्रित, सुरक्षित वातावरण में साथी छात्रों से जुड़ें।
ta: பயிற்சி பெற்ற தன்னார்வலர்களுடன் கட்டுப்படுத்தப்பட்ட, பாதுகாப்பான சூழலில் சக மாணவர்களுடன் இணைந்து கொள்ளுங்கள்.

source: Join Community
hi: समुदाय में शामिल हों
ta: சமூகத்தில் சேருங்கள்

source: Need immediate help?
hi: तत्काल सहायता की आवश्यकता है?
ta: உடனடி உதவி தேவையா?

source: If you're experiencing a mental health emergency, please contact:
hi: यदि आप मानसिक स्वास्थ्य आपातकाल का सामना कर रहे हैं, तो कृपया संपर्क करें:
ta: நீங்கள் மன நல அவசரநிலையை அனுபவித்துக் கொண்டிருந்தால், தயவுசெய்து தொடர்பு கொள்ளுங்கள்:

source: Campus Counseling Center
hi: कैंपस परामर्श केंद्र
ta: வளாக ஆலோசனை மையம்

source: Extension:
hi: एक्सटेंशन:
ta: நீட்சி:

source: National Helpline
hi: राष्ट्रीय हेल्पलाइन
ta: தேசிய உதவி இல்லம்

source: Emergency Services
hi: आपातकालीन सेवाएं
ta: அவசர சேவைகள்

source: Book an Appointment
hi: अपॉइंटमेंट बुक करें
ta: சந்திப்பை முன்பதிவு செய்யுங்கள்

source: Schedule confidential sessions with professional counselors
hi: पेशेवर परामर्शदाताओं के साथ गोपनीय सत्र निर्धारित करें
ta: தொழில்முறை ஆலோசகர்களுடன் ரகசிய அமர்வுகளை திட்டமிடுங்கள்

source: Step 1: Choose Counselor
hi: चरण 1: परामर्शदाता चुनें
ta: படி 1: ஆலோசகரைப் தேர்ந்தெடுக்கவும்

source: Clinical Psychologist
hi: नैदानिक मनोवैज्ञानिक
ta: மருத்துவ உளவியல் நிபுணர்

source: Specializes in anxiety and depression
hi: चिंता और अवसाद में विशेषज्ञ
ta: கவலை மற்றும் மனச்சோர்வில் நிபுணத்துவம் பெற்றவர்

source: Licensed Therapist
hi: लाइसेंसशुदा चिकित्सक
ta: அங்கீகரிக்கப்பட்ட தெராபிஸ்ட்

source: Focuses on stress management
hi: तनाव प्रबंधन पर केंद्रित
ta: மன அழுத்த மேலாண்மையில் கவனம் செலுத்துகிறார்

source: Mental Health Counselor
hi: मानसिक स्वास्थ्य परामर्शदाता
ta: மனநல ஆலோசகர்

source: Student support specialist
hi: छात्र सहायता विशेषज्ञ
ta: மாணவர் ஆதரவு நிபுணர்

source: Step 2: Choose Time
hi: चरण 2: समय चुनें
ta: படி 2: நேரத்தைத் தேர்ந்தெடுக்கவும்

source: Date
hi: दिनांक
ta: தேதி

source: Available Times
hi: उपलब्ध समय
ta: கிடைக்கும் நேரங்கள்

source: Step 3: Additional Information (Optional)
hi: चरण 3: अतिरिक्त जानकारी (वैकल्पिक)
ta: படி 3: கூடுதல் தகவல் (விருப்பத்தேர்வு)

source: Reason for appointment or any specific concerns
hi: अपॉइंटमेंट का कारण या कोई विशिष्ट चिंता
ta: சந்திப்புக்கான காரணம் அல்லது குறிப்பிட்ட கவலைகள்

source: This information will help your counselor prepare for your session...
hi: यह जानकारी आपके परामर्शदाता को आपके सत्र की तैयारी में मदद करेगी...
ta: இந்தத் தகவல் உங்கள் ஆலோசகர் உங்கள் அமர்வுக்கு தயாராக உதவும்...

source: This information is confidential and secure
hi: यह जानकारी गोपनीय और सुरक्षित है
ta: இந்தத் தகவல் ரகசியமானதும் பாதுகாப்பானதும் ஆகும்

source: I prefer to remain anonymous until my appointment
hi: मैं अपनी अपॉइंटमेंट तक गुमनाम रहना पसंद करता हूं
ta: என் சந்திப்பு வரை நான் அடையாளம் காட்டாமல் இருக்க விரும்புகிறேன்

source: For urgent situations, call our crisis hotline:
hi: आपातकालीन स्थितियों के लिए, हमारी संकट हेल्पलाइन पर कॉल करें:
ta: அவசர நிலைகளில், எங்கள் உதவி எண் அழைக்கவும்:

source: or campus counseling:
hi: या कैंपस परामर्श:
ta: அல்லது வளாக ஆலோசனை:

source: Ext.
hi: एक्स.
ta: எக்ஸ்ட்.

source: AI Support Chat
hi: एआई सहायता चैट
ta: AI ஆதரவு அரட்டை

source: AI Mental Health Support
hi: एआई मानसिक स्वास्थ्य सहायता
ta: AI மனநல ஆதரவு

source: Get immediate help and coping strategies
hi: तत्काल सहायता और मुकाबला रणनीतियां प्राप्त करें
ta: உடனடி உதவி மற்றும் சமாளிக்கும் உத்திகள் பெறுங்கள்

source: Hello! I'm here to provide mental health support and guidance. How are you feeling today? Please feel free to share what's on your mind.
hi: नमस्ते! मैं यहां मानसिक स्वास्थ्य सहायता और मार्गदर्शन प्रदान करने के लिए हूं। आज आप कैसा महसूस कर रहे हैं? कृपया अपने मन की बात साझा करने में संकोच न करें।
ta: வணக்கம்! மனநல ஆதரவும் வழிகாட்டுதலும் வழங்க நான் இங்கே இருக்கிறேன். இன்று நீங்கள் எப்படி உணருகிறீர்கள்? உங்கள் மனதில் இருப்பதை தயங்காமல் பகிர்ந்து கொள்ளுங்கள்.

source: Type your message here...
hi: यहाँ अपना संदेश टाइप करें...
ta: உங்கள் செய்தியை இங்கே தட்டச்சு செய்யவும்...

source: Send
hi: भेजें
ta: அனுப்பு

source: This AI assistant provides general support and coping strategies. For urgent situations, please contact emergency services or your campus counseling center.
hi: यह एआई सहायक सामान्य सहायता और मुकाबला रणनीतियां प्रदान करता है। आपातकालीन स्थितियों के लिए, कृपया आपातकालीन सेवाओं या अपने कैंपस परामर्श केंद्र से संपर्क करें।
ta: இந்த AI உதவியாளர் பொது ஆதரவும் சமாளிக்கும் உத்திகளையும் வழங்குகிறது. அவசர நிலைகளில், தயவுசெய்து அவசர சேவைகளை அல்லது உங்கள் வளாக ஆலோசனை மையத்தை தொடர்பு கொள்ளுங்கள்.

source: Schedule with a counselor
hi: परामर्शदाता के साथ निर्धारित करें
ta: ஆலோசகருடன் திட்டமிடுங்கள்

source: Self-help materials
hi: स्वयं सहायता सामग्री
ta: சுய உதவி பொருட்கள்

source: Explore
hi: खोजें
ta: ஆராயுங்கள்

source: Community
hi: समुदाय
ta: சமூகம்

source: Peer support forum
hi: साथी सहारा मंच
ta: சக ஆதரவு மன்றம்

source: Join
hi: शामिल हों
ta: சேரவும்

source: Emergency Contacts
hi: आपातकालीन संपर्क
ta: அவசர தொடர்புகள்

source: National Crisis Helpline
hi: राष्ट्रीय संकट हेल्पलाइन
ta: தேசிய அவசர உதவி எண்

source: Mental Health Resources
hi: मानसिक स्वास्थ्य संसाधन
ta: மனநல வளங்கள்

source: Peer Support Forum
ta: சக ஆதரவு மன்றம்

source: New Post
hi: नई पोस्ट
ta: புதிய பதிவு

source: This is a safe, moderated space. Remember to respect privacy and avoid sharing personal identifying information.
hi: यह एक सुरक्षित, नियंत्रित स्थान है। गोपनीयता का सम्मान करना और व्यक्तिगत पहचान की जानकारी साझा न करना याद रखें।
ta: இது பாதுகாப்பான, கட்டுப்படுத்தப்பட்ட இடம். தனியுரிமையை மதிக்கவும், தனிப்பட்ட அடையாளத் தகவலை பகிர்வதைத் தவிர்க்கவும்.

source: Anonymous Student
hi: गुमनाम छात्र
ta: அடையாளம் தெரியாத மாணவர்

source: 2 hours ago
hi: 2 घंटे पहले
ta: 2 மணி நேரம் முன்பு

source: Discussion
ta: ஆலோசனை

source: Dealing with exam anxiety
hi: परीक्षा की चिंता से निपटना
ta: தேர்வு பயத்தை சமாளிப்பது

source: Has anyone found effective ways to manage the stress during final exams? I've been having trouble sleeping and concentrating. Any advice would be appreciated.
hi: क्या किसी को अंतिम परीक्षा के दौरान तनाव को संभालने के प्रभावी तरीके मिले हैं? मुझे सोने और ध्यान केंद्रित करने में समस्या हो रही है। कोई भी सलाह की सराहना की जाएगी।
ta: இறுதி தேர்வுகளின்போது மன அழுத்தத்தை கட்டுப்படுத்த பயனுள்ள வழிகளை யாரேனும் கண்டுபிடித்துள்ளீர்களா? எனக்கு தூங்குவதிலும் கவனம் செலுத்துவதிலும் சிரமம் உள்ளது. ஏதேனும் அறிவுரைகள் இருந்தால் பாராட்டப்படும்.

source: 5 replies
hi: 5 जवाब
ta: 5 பதில்கள்

source: Study Buddy
hi: अध्ययन मित्र
ta: படிப்பு தோழன்

source: 1 day ago
hi: 1 दिन पहले
ta: 1 நாள் முன்பு

source: Resource Share
ta: வள பகிர்வு

source: Meditation apps that actually work
hi: ध्यान ऐप्स जो वास्तव में काम करते हैं
ta: உண்மையில் பயனுள்ள தியான பயன்பாடுகள்

source: I've been using meditation apps for a few months now and wanted to share the ones that have really helped me with stress and focus. Here are my top 3...
hi: मैं कुछ महीनों से ध्यान ऐप्स का उपयोग कर रहा हूं और उन ऐप्स को साझा करना चाहता था जिन्होंने वास्तव में तनाव और फोकस में मेरी मदद की है। यहाँ मेरे शीर्ष 3 हैं...
ta: நான் பல மாதங்களாக தியான பயன்பாடுகளைப் பயன்படுத்தி வருகிறேன், மன அழுத்தமும் கவனமும் மேம்பட உதவியவற்றைப் பகிர விரும்புகிறேன். இவை எனது முதல் 3...

source: 12 replies
hi: 12 जवाब
ta: 12 பதில்கள்

source: HopefulGrad
hi: आशावान स्नातक
ta: நம்பிக்கையுள்ள பட்டதாரி

source: 3 days ago
hi: 3 दिन पहले
ta: 3 நாள் முன்பு

source: Support
ta: ஆதரவு

source: Thank you to this community
hi: इस समुदाय को धन्यवाद
ta: இந்த சமூகத்திற்கு நன்றி

source: I just wanted to say thanks to everyone who has been supportive. Going through a tough time but the encouragement here has meant a lot.
hi: मैं केवल उन सभी को धन्यवाद देना चाहता था जो सहायक रहे हैं। कठिन समय से गुजर रहा हूँ लेकिन यहाँ की प्रोत्साहना का बहुत मतलब है।
ta: ஆதரவு அளித்த அனைவருக்கும் நன்றி சொல்ல விரும்புகிறேன். கடினமான காலத்தை கடந்து கொண்டிருக்கிறேன், இங்குள்ள ஊக்குவிப்பு மிகவும் அர்த்தமுள்ளதாக இருந்தது.

source: 8 replies
hi: 8 जवाब
ta: 8 பதில்கள்

source: Previous
hi: पिछला
ta: முன்

source: Next
hi: अगला
ta: அடுத்து

source: Create New Post
hi: नई पोस्ट बनाएं
ta: புதிய பதிவை உருவாக்கவும்

source: Category
hi: श्रेणी
ta: வகை

source: Advice Request
hi: सलाह अनुरोध
ta: ஆலோசனை கோரிக்கை

source: Title
hi: शीर्षक
ta: தலைப்பு

source: Brief description of your post
hi: आपकी पोस्ट का संक्षिप्त विवरण
ta: உங்கள் பதிவின் சுருக்கமான விளக்கம்

source: Content
hi: सामग्री
ta: உள்ளடக்கம்

source: Share your thoughts, questions, or resources...
hi: अपने विचार, प्रश्न या संसाधन साझा करें...
ta: உங்கள் எண்ணங்கள், கேள்விகள் அல்லது வளங்களைப் பகிரவும்...

source: Post anonymously
hi: गुमनाम रूप से पोस्ट करें
ta: அடையாளம் காட்டாமல் பதிவு செய்யவும்

source: Cancel
hi: रद्द करें
ta: ரத்து செய்

source: Please enter a title for your post.
hi: कृपया अपनी पोस्ट के लिए एक शीर्षक दर्ज करें।
ta: உங்கள் பதிவுக்கான தலைப்பை உள்ளிடுங்கள்.

source: Please enter content for your post.
hi: कृपया अपनी पोस्ट के लिए सामग्री दर्ज करें।
ta: உங்கள் பதிவுக்கான உள்ளடக்கத்தை உள்ளிடுங்கள்.

source: Posting...
hi: पोस्ट कर रहे हैं...
ta: பதிவேற்றப்படுகிறது...

source: Your post has been created successfully! (In a real implementation, it would appear in the forum)
hi: आपकी पोस्ट सफलतापूर्वक बनाई गई है! (वास्तविक कार्यान्वयन में, यह फ़ोरम में दिखाई देगी)
ta: உங்கள் பதிவு வெற்றிகரமாக உருவாக்கப்பட்டது! (உண்மையான அமல்பாட்டில், இது மன்றத்தில் தோன்றும்)

source: Failed to create post. Please try again.
hi: पोस्ट बनाने में असफल। कृपया पुनः प्रयास करें।
ta: பதிவை உருவாக்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

source: An error occurred. Please try again.
hi: एक त्रुटि हुई। कृपया पुनः प्रयास करें।
ta: ஒரு பிழை ஏற்பட்டது. மீண்டும் முயற்சிக்கவும்.

source: Enter your reply:
hi: अपना उत्तर दर्ज करें:
ta: உங்கள் பதிலை உள்ளிடவும்:

source: Reply posted! (In a real implementation, this would be saved to the database)
hi: उत्तर पोस्ट किया गया! (वास्तविक कार्यान्वयन में, यह डेटाबेस में सहेजा जाएगा)
ta: பதில் பதிவிடப்பட்டது! (உண்மையான அமல்பாட்டில், இது தரவுத்தளத்தில் சேமிக்கப்படும்)
